[Survived] ArrowFunction
src/utils/functions/sleep.js:1:15
-const sleep = (time = 1000) =>
-    new Promise((resolve) => {
-        setTimeout(resolve, time);
-    });
+const sleep = () => undefined;
 
 export default sleep;

[Timeout] BlockStatement
src/utils/functions/sleep.js:2:30
 const sleep = (time = 1000) =>
-    new Promise((resolve) => {
-        setTimeout(resolve, time);
-    });
+    new Promise((resolve) => {});
 
 export default sleep;
