[Killed] BlockStatement
views/home/services/get-data.js:8:35
 
 //#endregion
 
-export const getRepos = (user) => {
-    return api.get(ENDPOINTS.REPOS(user));
-};
+export const getRepos = (user) => {};
 
 export const getStarred = (user) => {

[Killed] BlockStatement
views/home/services/get-data.js:12:37
     return api.get(ENDPOINTS.REPOS(user));
 };
 
-export const getStarred = (user) => {
-    return api.get(ENDPOINTS.STARRED(user));
-};
+export const getStarred = (user) => {};
 
